trade_exp/src/DataProcessors/КлиентБанк/КлиентБанк.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>КлиентБанк</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ОтчетОВыгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="844403ae-13ef-4788-a892-258713ee38c4">
    <name>ОтчетОЗагрузке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9be003a7-74c5-4325-b7f3-895f6501902b">
    <name>ПроводитьДокументы</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a24a929a-d5f9-498e-ba12-274230163768">
    <name>СоздаватьКонтрагентов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Эквайер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетЭквайера</name>
    <type>
      <types>CatalogRef.БанковскиеСчетаКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорЭквайринга</name>
    <type>
      <types>CatalogRef.ДоговорыЭквайринга</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="33b28cec-f67c-4b61-9b0b-fa4771747e08">
    <name>РежимЗаполненияКонтрагентаПоQRПлатежу</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections>
    <name>БанковскиеСчета</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Ссылка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаПоследнейВыгрузки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НастройкаОбмена</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КВыгрузке</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Пометка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ЕстьВозможностьПрямогоОбмена</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="dcefc53b-6b8d-41cf-bac9-432c76e90c0f">
      <name>ПоследняяВыписка</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>30</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыКВыгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВидДокумента</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>БанковскийСчет</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НазначениеПлатежа</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Дата</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ДатаВыгрузки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Операция</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номер</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Ссылка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ОписаниеОшибок</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Организация</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Выгружать</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НомерВходящегоДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="8c0ff1ac-e94a-4cfe-a37b-672925c1bcdc">
    <name>Файлы</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="7366c22f-5098-4e87-97eb-dbad1129afd3">
    <name>ДокументыКЗагрузке</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:DataProcessor>

trade_exp/src/InformationRegisters/ПоследнийОбменСБанками/ПоследнийОбменСБанками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="19ebabbf-691a-4d93-81a2-ae4c4997aad8">
  <name>ПоследнийОбменСБанками</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="1ecc3fd5-4ac5-46e3-845a-e8df50c2d6c2">
    <name>ДатаВыгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="1b87d11c-cb6c-4f57-996d-0eb6391d006a">
    <name>ДатаНачалаЗагрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="43df38eb-2461-434f-983a-785109c0a886">
    <name>ДатаКонцаЗагрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="2d37dda2-2b6d-4c52-a004-1acc3e4b69c8">
    <name>БанковскийСчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/ГрафикПлатежей/ГрафикПлатежей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ГрафикПлатежей</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>Сумма</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes>
    <name>ТипОбъектаОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ФормаОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбластьПланирования</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаАктуальностиГрафика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Номер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Дата</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions>
    <name>ПоступлениеСписание</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>БанковскийСчетКасса</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>ПлательщикПолучатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>ДатаПлатежа</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>ОбъектОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Enums/СтатусыДоговоровКонтрагентов/СтатусыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтатусыДоговоровКонтрагентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Действует</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="3915309e-1c9c-447e-82d1-cd037c7784b2">
    <name>НеСогласован</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="26b5dc0e-bfd2-43c0-b272-c13aae125257">
    <name>Закрыт</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/ТипыДоговоров/ТипыДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыДоговоров</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="7167043e-3ed3-411a-a338-9e59ecb123f5">
    <name>СПокупателем</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="81324e26-995c-4379-af71-5ad2721ba02b">
    <name>СДавальцем2_5</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/ТипыПлатежныхДокументов/ТипыПлатежныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыПлатежныхДокументов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ПлатежноеПоручение</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПлатежныйОрдер</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ИнкассовоеПоручение</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПлатежноеТребование</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Documents/СписаниеБезналичныхДенежныхСредств/СписаниеБезналичныхДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СписаниеБезналичныхДенежныхСредств</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="16c4aa94-79eb-4036-85b5-10347433806a">
    <name>ДатаЗагрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="473ca31b-84f9-4f0f-80d4-373d399498b4">
    <name>ИмяКонтрагента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="ab2b4e73-8dc2-4506-995b-60a7baebb5de">
    <name>РасшифровкаПлатежа</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Document>

trade_exp/src/DataProcessors/КлиентБанк/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	//&После ("ЗаполнитьРеквизитыПоступления")
	//Процедура ОБР_ЗаполнитьРеквизитыПоступления(ДокументыКЗагрузке, СтрокаДокумента, ДокументОбъект, СоздаватьКонтрагентов, ПроводитьДокументы)
	//	ЗаполнитьОснованиеПлатежа(ДокументОбъект, СтрокаДокумента, ПроводитьДокументы, "Поступление");		
	//КонецПроцедуры       
	
Функция МожноПолучитьКомиссиюИзНазаченияПлатежа(СтрокаНазначениеПлатежа) Экспорт
	ЕстьКомиссия = СтрНайти(СтрокаНазначениеПлатежа,"КОМИССИЯ");
	Если ЕстьКомиссия = 0 Тогда	
		Возврат 0;
	Иначе	
		ИщемСуммуВСтроке = Прав(СтрокаНазначениеПлатежа, СтрДлина(СтрокаНазначениеПлатежа)-ЕстьКомиссия+1);
		ПозицияПробела = СтрНайти(ИщемСуммуВСтроке," ");
		ПозицияТочки = СтрНайти(ИщемСуммуВСтроке,".");
		Если ПозицияТочки = 0 Тогда
			Возврат 0;
		Иначе	
			ИщемСуммуВСтроке = СокрЛП(Сред(ИщемСуммуВСтроке, ПозицияПробела, ПозицияТочки-ПозицияПробела+3));
			ИщемСуммуВСтроке = СтрЗаменить(ИщемСуммуВСтроке, ",", "");
			ИщемСуммуВСтроке = СтрЗаменить(ИщемСуммуВСтроке, " ", "");
			Попытка
				ИтоговаяСумма = Число(ИщемСуммуВСтроке)
			Исключение
				Возврат 0
			КонецПопытки;		
			Если ИтоговаяСумма = 0 Тогда 
				Возврат 0
			Иначе
				Возврат ИтоговаяСумма
			КонецЕсли;	  
		КонецЕсли;	
	КонецЕсли;
КонецФункции

&После ("ЗаполнитьЗначениеЭкспорта")
Процедура ОБР_ЗаполнитьЗначениеЭкспорта(СтрокаЭкспорта, ВыборкаДляЭкспорта)
	Если ПустаяСтрока(ВыборкаДляЭкспорта.НомерВходящегоДокумента) Тогда
		СтрокаЭкспорта.Номер = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ВыборкаДляЭкспорта.Номер, Истина, Истина);
	Иначе
		СтрокаЭкспорта.Номер = ВыборкаДляЭкспорта.НомерВходящегоДокумента;	
	КонецЕсли;
КонецПроцедуры

&Вместо ("ЗаполнитьКонтрагентов")
Процедура ОБР_ЗаполнитьКонтрагентов(ДокументыКЗагрузке, ТаблицаДокументов) Экспорт
	
	Запрос = Новый Запрос;
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТаблицаДокументов.НомерСтроки,
	|	ТаблицаДокументов.ИмяКонтрагента КАК Наименование,
	|	ТаблицаДокументов.СокрИмяКонтрагента КАК СокращенноеНаименование,
	|	ТаблицаДокументов.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ТаблицаДокументов.Исходящий ТОГДА
	|			ТаблицаДокументов.ПолучательИНН
	|		ИНАЧЕ
	|			ТаблицаДокументов.ПлательщикИНН
	|	КОНЕЦ КАК ИНН,
	|	ВЫБОР
	|		КОГДА ТаблицаДокументов.Исходящий ТОГДА
	|		ТаблицаДокументов.ПолучательКПП
	|	ИНАЧЕ
	|		ТаблицаДокументов.ПлательщикКПП
	|	КОНЕЦ КАК КПП,
	|	ТаблицаДокументов.ПроверятьИНН,
	|	ТаблицаДокументов.ПроверятьКПП,
	|	ВЫБОР
	|		КОГДА ТаблицаДокументов.Исходящий ТОГДА
	|			ТаблицаДокументов.ПолучательСчет
	|		ИНАЧЕ
	|			ТаблицаДокументов.ПлательщикСчет
	|	КОНЕЦ КАК НомерСчета,
	|	ТаблицаДокументов.ВидОперации
	|
	|ПОМЕСТИТЬ ТаблицаДокументов
	|
	|ИЗ
	|	&ТаблицаДокументов КАК ТаблицаДокументов
	|";
	
	Запрос.УстановитьПараметр("ТаблицаДокументов", ТаблицаДокументов);
	Запрос.Выполнить();
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТаблицаДокументов.НомерСтроки КАК НомерСтроки,
	|	ДанныеСправочника.Владелец КАК Контрагент,
	|	ДанныеСправочника.Ссылка КАК СчетКонтрагента,
	|	0 КАК Приоритет
	|
	|ИЗ
	|	ТаблицаДокументов
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Справочник.БанковскиеСчетаОрганизаций КАК ДанныеСправочника
	|	ПО
	|		ДанныеСправочника.НомерСчета = ТаблицаДокументов.НомерСчета
	|		И ДанныеСправочника.Владелец.ИНН = ТаблицаДокументов.ИНН
	|		И ТаблицаДокументов.ПроверятьИНН
	|		И НЕ ДанныеСправочника.Закрыт,
	|	Константа.ИспользоватьПередачиТоваровМеждуОрганизациями КАК ИспользоватьПередачиТоваровМеждуОрганизациями
	|ГДЕ
	|	ВЫБОР
	|		КОГДА ТаблицаДокументов.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка)
	|				ИЛИ ТаблицаДокументов.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзДругойОрганизации)
	|				ИЛИ ТаблицаДокументов.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию)
	|			ТОГДА ИспользоватьПередачиТоваровМеждуОрганизациями.Значение
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ // Контрагент уже найден, ищем счет
	|	ТаблицаДокументов.НомерСтроки КАК НомерСтроки,
	|	Контрагенты.Ссылка КАК Контрагент,
	|	ДанныеСправочника.Ссылка КАК СчетКонтрагента,
	|	5 КАК Приоритет
	|
	|ИЗ
	|	ТаблицаДокументов
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Справочник.Контрагенты КАК Контрагенты
	|	ПО
	|		Контрагенты.Ссылка = ТаблицаДокументов.Контрагент
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Справочник.БанковскиеСчетаКонтрагентов КАК ДанныеСправочника
	|	ПО
	|		ДанныеСправочника.НомерСчета = ТаблицаДокументов.НомерСчета
	|		И ДанныеСправочника.Владелец = Контрагенты.Ссылка
	|		И НЕ ДанныеСправочника.Закрыт
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаДокументов.НомерСтроки КАК НомерСтроки,
	|	ДанныеСправочника.Владелец КАК Контрагент,
	|	ДанныеСправочника.Ссылка КАК СчетКонтрагента,
	|	10 КАК Приоритет
	|
	|ИЗ
	|	ТаблицаДокументов
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Справочник.БанковскиеСчетаКонтрагентов КАК ДанныеСправочника
	|	ПО
	|		ДанныеСправочника.НомерСчета = ТаблицаДокументов.НомерСчета
	|		И ДанныеСправочника.Владелец.ИНН = ТаблицаДокументов.ИНН
	|		И ДанныеСправочника.Владелец.КПП = ТаблицаДокументов.КПП
	|		И ТаблицаДокументов.ПроверятьКПП
	|		И НЕ ДанныеСправочника.Закрыт
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаДокументов.НомерСтроки КАК НомерСтроки,
	|	ДанныеСправочника.Владелец КАК Контрагент,
	|	ДанныеСправочника.Ссылка КАК СчетКонтрагента,
	|	20 КАК Приоритет
	|
	|ИЗ
	|	ТаблицаДокументов
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Справочник.БанковскиеСчетаКонтрагентов КАК ДанныеСправочника
	|	ПО
	|		ДанныеСправочника.НомерСчета = ТаблицаДокументов.НомерСчета
	|		И ДанныеСправочника.Владелец.ИНН = ТаблицаДокументов.ИНН
	|		И ТаблицаДокументов.ПроверятьИНН
	|		И НЕ ДанныеСправочника.Закрыт
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаДокументов.НомерСтроки КАК НомерСтроки,
	|	ДанныеСправочника.Владелец КАК Контрагент,
	|	ДанныеСправочника.Ссылка КАК СчетКонтрагента,
	|	30 КАК Приоритет
	|
	|ИЗ
	|	ТаблицаДокументов
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Справочник.БанковскиеСчетаКонтрагентов КАК ДанныеСправочника
	|	ПО
	|		ДанныеСправочника.НомерСчета = ТаблицаДокументов.НомерСчета
	|		И (ДанныеСправочника.Владелец.НаименованиеПолное = ТаблицаДокументов.Наименование
	|			ИЛИ ДанныеСправочника.Владелец.НаименованиеПолное = ТаблицаДокументов.СокращенноеНаименование)
	|		И НЕ ДанныеСправочника.Закрыт
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаДокументов.НомерСтроки КАК НомерСтроки,
	|	ДанныеСправочника.Ссылка КАК Контрагент,
	|	НЕОПРЕДЕЛЕНО КАК СчетКонтрагента,
	|	40 КАК Приоритет
	|
	|ИЗ
	|	ТаблицаДокументов
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Справочник.Контрагенты КАК ДанныеСправочника
	|	ПО
	|		ДанныеСправочника.ИНН = ТаблицаДокументов.ИНН
	|		И ДанныеСправочника.КПП = ТаблицаДокументов.КПП
	|		И ТаблицаДокументов.ПроверятьКПП
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаДокументов.НомерСтроки КАК НомерСтроки,
	|	ДанныеСправочника.Ссылка КАК Контрагент,
	|	НЕОПРЕДЕЛЕНО КАК СчетКонтрагента,
	|	50 КАК Приоритет
	|
	|ИЗ
	|	ТаблицаДокументов
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Справочник.Контрагенты КАК ДанныеСправочника
	|	ПО
	|		ДанныеСправочника.ИНН = ТаблицаДокументов.ИНН
	|		И ТаблицаДокументов.ПроверятьИНН
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаДокументов.НомерСтроки КАК НомерСтроки,
	|	ДанныеСправочника.Ссылка КАК Контрагент,
	|	НЕОПРЕДЕЛЕНО КАК СчетКонтрагента,
	|	60 КАК Приоритет
	|
	|ИЗ
	|	ТаблицаДокументов
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Справочник.Контрагенты КАК ДанныеСправочника
	|	ПО
	|		ДанныеСправочника.НаименованиеПолное = ТаблицаДокументов.Наименование
	|		И (ДанныеСправочника.ИНН = """"
	|			ИЛИ НЕ ТаблицаДокументов.ПроверятьИНН)
	|		И (ДанныеСправочника.КПП = """"
	|			ИЛИ НЕ ТаблицаДокументов.ПроверятьКПП)
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаДокументов.НомерСтроки КАК НомерСтроки,
	|	ДанныеСправочника.Ссылка КАК Контрагент,
	|	НЕОПРЕДЕЛЕНО КАК СчетКонтрагента,
	|	70 КАК Приоритет
	|
	|ИЗ
	|	ТаблицаДокументов
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Справочник.ФизическиеЛица КАК ДанныеСправочника
	|	ПО
	|		ДанныеСправочника.Наименование = ТаблицаДокументов.Наименование
	|		И (ДанныеСправочника.ИНН = ТаблицаДокументов.ИНН
	|			ИЛИ ДанныеСправочника.ИНН = """"
	|			ИЛИ НЕ ТаблицаДокументов.ПроверятьИНН)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаДокументов.НомерСтроки,
	|	ДанныеСправочника.Владелец,
	|	ДанныеСправочника.Ссылка,
	|	80
	|
	|ИЗ
	|	ТаблицаДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Справочник.БанковскиеСчетаКонтрагентов КАК ДанныеСправочника
	|		ПО ДанныеСправочника.НомерСчета = ТаблицаДокументов.НомерСчета
	|			И НЕ ДанныеСправочника.Закрыт
	|			И (ДанныеСправочника.Владелец.ИНН = """"
	|				ИЛИ НЕ ТаблицаДокументов.ПроверятьИНН)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки,
	|	Приоритет
	|";
	
	//УстановитьПривилегированныйРежим(Истина); (Альтерра)
	Выборка = Запрос.Выполнить().Выбрать();
	//УстановитьПривилегированныйРежим(Ложь); (Альтерра)
	
	Пока Выборка.СледующийПоЗначениюПоля("НомерСтроки") Цикл
		
		СтрокаДокумента = ДокументыКЗагрузке.Найти(Выборка.НомерСтроки, "НомерСтроки");
		Если СтрокаДокумента <> Неопределено Тогда
			
			НайденоКонтрагентов = 0;
			ТекущийПриоритет = 99;
			
			Пока Выборка.Следующий() Цикл 
				//+ Альтерра 
				Если (СтрНайти(СтрокаДокумента.НазначениеПлатежа, "Выдача процентного займа") > 0 Или СтрНайти(СтрокаДокумента.НазначениеПлатежа, "Возврат займа") > 0
					Или СтрНайти(СтрокаДокумента.НазначениеПлатежа, "Оплата по договору аренды") > 0) И ТипЗнч(Выборка.Контрагент) = Тип("СправочникСсылка.Организации") Тогда
					Продолжить;
				КонецЕсли;
				//-
				
				Если ТекущийПриоритет < Выборка.Приоритет Тогда
					Прервать;
				КонецЕсли;
				
				ТекущийПриоритет = Выборка.Приоритет;
				НайденоКонтрагентов = НайденоКонтрагентов + 1;
				
				Если НайденоКонтрагентов = 1 Тогда
					
					СтрокаДокумента.Контрагент = Выборка.Контрагент;
					СтрокаДокумента.НайденКонтрагент = Истина;
					
					//+ Альтерра
					Если ЗначениеЗаполнено(Выборка.СчетКонтрагента) И Не ЗначениеЗаполнено(СтрокаДокумента.СчетКонтрагента) Тогда
						//-
						СтрокаДокумента.СчетКонтрагента = Выборка.СчетКонтрагента;
						СтрокаДокумента.НайденСчетКонтрагента = Истина;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
			// Если найдены дубли с одинаковым приоритетом, то контрагент останется пустым и новый создаваться не будет.
			Если НайденоКонтрагентов > 1 Тогда
				
				СтрокаДокумента.Контрагент = Неопределено;
				СтрокаДокумента.СчетКонтрагента = Неопределено;
				СтрокаДокумента.СоздаватьКонтрагента = Ложь;
				СтрокаДокумента.НайденКонтрагент = Ложь;
				СтрокаДокумента.НайденСчетКонтрагента = Ложь;
				
				ДобавитьЗамечание(СтрокаДокумента.ОшибкиЗагрузки,
				СтрШаблон(НСтр("ru='Найдено более одного контрагента (%1)!'"), СтрокаДокумента.ИмяКонтрагента));
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьОснованиеПлатежа(ДокументОбъект, СтрокаДокумента, ТипДокумента, ПроводитьДокументы = Неопределено) Экспорт      
	Для каждого СтрокаРасшифровки Из ДокументОбъект.РасшифровкаПлатежа Цикл
		если ТипДокумента = "Поступление"  тогда 
			Если значениезаполнено(СтрокаРасшифровки.ОснованиеПлатежа) Тогда
				возврат; 
			КонецЕсли;	
		конецесли;	      
		если ТипДокумента = "Списание"  тогда 
			Если значениезаполнено(СтрокаРасшифровки.ОбъектРасчетов) Тогда
				возврат; 
			КонецЕсли;	
		конецесли;	
	конеццикла;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Организация = &Организация
	|	И ДоговорыКонтрагентов.Контрагент = &Контрагент
	|	И ДоговорыКонтрагентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.Действует)
	|	И ДоговорыКонтрагентов.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СПокупателем)
	|	И НЕ ДоговорыКонтрагентов.ПометкаУдаления";
	
	Если ТипДокумента = "Списание" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"Перечисление.ТипыДоговоров.СПокупателем","Перечисление.ТипыДоговоров.СПоставщиком");
	КонецЕсли;	
	
	Запрос.УстановитьПараметр("Контрагент", ДокументОбъект.Контрагент);
	Запрос.УстановитьПараметр("Организация", ДокументОбъект.Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Выгрузить().Количество()=1 тогда 
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Основание = Выборка.Ссылка;
		для каждого стр из ДокументОбъект.РасшифровкаПлатежа цикл  
			Если ТипДокумента = "Поступление" Тогда
				стр.ОснованиеПлатежа = Основание;
				стр.ОбъектРасчетов = Справочники.ОбъектыРасчетов.НайтиПоРеквизиту("Объект", Основание); 
			Иначе 
				стр.ОбъектРасчетов = Справочники.ОбъектыРасчетов.НайтиПоРеквизиту("Объект", Основание);
			КонецЕсли;	
			Если Не значениезаполнено(стр.СтатьяДвиженияДенежныхСредств) тогда
				стр.СтатьяДвиженияДенежныхСредств = ДенежныеСредстваСервер.СтатьяДвиженияДенежныхСредствОбъектаРасчетов(стр.ОбъектРасчетов, СтрокаДокумента.ВидОперации);
			КонецЕсли;	
			
		конеццикла;
		Если СокрЛП(ДокументОбъект.ОшибкиЗагрузки) = "" Тогда  
			
			Если ПроводитьДокументы = Неопределено Или ПроводитьДокументы Тогда
				РежимЗаписи = РежимЗаписиДокумента.Проведение;
			Иначе
				РежимЗаписи = РежимЗаписиДокумента.Запись;
			КонецЕсли;   
			
		Иначе
			РежимЗаписи = РежимЗаписиДокумента.Запись;
		КонецЕсли;
		
		КлиентБанкСервер.Док_ЗаписатьОбъект(ДокументОбъект, РежимЗаписи, СтрокаДокумента);
	КонецЕсли;
КонецПроцедуры	

Процедура ПодготовитьСтрокиВыписки_Расширение(ДокументыКЗагрузке, БанковскийСчет, РеквизитыСчета, Эквайер, СчетЭквайера)
	
	ТипыПлатежныхДокументовПоступления = Новый Соответствие;
	ТипыПлатежныхДокументовПоступления.Вставить("ПЛАТЕЖНОЕПОРУЧЕНИЕ", Перечисления.ТипыПлатежныхДокументов.ПлатежноеПоручение);
	ТипыПлатежныхДокументовПоступления.Вставить("ПЛАТЕЖНОЕТРЕБОВАНИЕ", Перечисления.ТипыПлатежныхДокументов.ПлатежноеТребование);
	ТипыПлатежныхДокументовПоступления.Вставить("ПЛАТЕЖНЫЙОРДЕР", Перечисления.ТипыПлатежныхДокументов.ПлатежныйОрдер);
	ТипыПлатежныхДокументовПоступления.Вставить("БАНКОВСКИЙОРДЕР", Перечисления.ТипыПлатежныхДокументов.ПлатежныйОрдер);
	ТипыПлатежныхДокументовПоступления.Вставить("МЕМОРИАЛЬНЫЙОРДЕР", Перечисления.ТипыПлатежныхДокументов.ПлатежныйОрдер);
	ТипыПлатежныхДокументовПоступления.Вставить("ИНКАССОВОЕПОРУЧЕНИЕ", Перечисления.ТипыПлатежныхДокументов.ИнкассовоеПоручение);
	
	ТипыПлатежныхДокументовСписания = Новый Соответствие;
	ТипыПлатежныхДокументовСписания.Вставить("ПЛАТЕЖНОЕПОРУЧЕНИЕ", Перечисления.ТипыПлатежныхДокументов.ПлатежноеПоручение);
	ТипыПлатежныхДокументовСписания.Вставить("ПЛАТЕЖНОЕТРЕБОВАНИЕ", Перечисления.ТипыПлатежныхДокументов.ПлатежноеТребование);
	ТипыПлатежныхДокументовСписания.Вставить("ПЛАТЕЖНЫЙОРДЕР", Перечисления.ТипыПлатежныхДокументов.ПлатежныйОрдер);
	ТипыПлатежныхДокументовСписания.Вставить("БАНКОВСКИЙОРДЕР", Перечисления.ТипыПлатежныхДокументов.БанковскийОрдер);
	ТипыПлатежныхДокументовСписания.Вставить("МЕМОРИАЛЬНЫЙОРДЕР", Перечисления.ТипыПлатежныхДокументов.БанковскийОрдер);
	ТипыПлатежныхДокументовСписания.Вставить("ИНКАССОВОЕПОРУЧЕНИЕ", Перечисления.ТипыПлатежныхДокументов.ИнкассовоеПоручение);
	
	СтатусыСоставителейТаможенныхПлатежей = Новый Массив;
	СтатусыСоставителейТаможенныхПлатежей.Добавить("06");
	СтатусыСоставителейТаможенныхПлатежей.Добавить("16");
	СтатусыСоставителейТаможенныхПлатежей.Добавить("17");
	СтатусыСоставителейТаможенныхПлатежей.Добавить("18");
	СтатусыСоставителейТаможенныхПлатежей.Добавить("19");
	СтатусыСоставителейТаможенныхПлатежей.Добавить("20");
	
	СобственныеСчета = КлиентБанкСервер.Док_СобственныеСчета(БанковскийСчет);
	
	НомерСчета = РеквизитыСчета.НомерСчета;
	
	//++ Локализация
	НомерЛицевогоСчета = РеквизитыСчета.НомерЛицевогоСчета;
	РазделЛицевогоСчета = РеквизитыСчета.РазделЛицевогоСчета;
	//-- Локализация
	
	// Подготовка строк выписки к поиску документов и контрагентов, заполнение общих реквизитов. Первичное распознавание.
	Для каждого СтрокаДокумента Из ДокументыКЗагрузке Цикл
		
		Если Не СтрокаДокумента.Загружать Или
			(Не СтрокаДокумента.ПлательщикСчет = НомерСчета
			И Не СтрокаДокумента.ПолучательСчет = НомерСчета) Тогда
			СтрокаДокумента.Загружать = Ложь;
			Продолжить;
		КонецЕсли;
		
		// Входящий или исходящий платеж
		Исходящий = (СтрокаДокумента.ПлательщикСчет = НомерСчета);
		СтрокаДокумента.Исходящий = Исходящий;
		
		//++ Локализация
		НеподходящийЛицевойСчет = СтрокаДокумента.ПлательщикЛицевойСчет <> НомерЛицевогоСчета
		И СтрокаДокумента.ПолучательЛицевойСчет <> НомерЛицевогоСчета;
		
		Если НеподходящийЛицевойСчет Тогда
			СтрокаДокумента.Загружать = Ложь;
			Продолжить;
		КонецЕсли;
		
		НеподходящийКодРаздела = СтрокаДокумента.АналитическийКодРаздела <> РазделЛицевогоСчета;
		
		Если Исходящий
			И НеподходящийКодРаздела Тогда
			СтрокаДокумента.Загружать = Ложь;
			Продолжить;
		КонецЕсли;
		//-- Локализация
		
		// Дата документа
		Если Не ЗначениеЗаполнено(СтрокаДокумента.ДатаДок) Тогда
			СтрокаДокумента.ДатаДок = ДенежныеСредстваКлиентСервер.ПолучитьДатуИзСтроки(СтрокаДокумента.Дата);
			Если Не ЗначениеЗаполнено(СтрокаДокумента.ДатаДок) Тогда
				СтрокаДокумента.ДатаДок = ДенежныеСредстваКлиентСервер.ПолучитьДатуИзСтроки(
				?(Исходящий, СтрокаДокумента.ДатаСписано, СтрокаДокумента.ДатаПоступило));
			КонецЕсли;
		КонецЕсли;
		
		// Тип платежного документа
		ТипСтрокой = СтрЗаменить(ВРЕГ(СтрЗаменить(СокрЛП(СтрокаДокумента.Операция), " ", "")), "Ё", "Е");
		Если Исходящий Тогда
			ТипПлатежногоДокумента = ТипыПлатежныхДокументовСписания.Получить(ТипСтрокой);
		Иначе
			ТипПлатежногоДокумента = ТипыПлатежныхДокументовПоступления.Получить(ТипСтрокой);
		КонецЕсли;
		Если ТипПлатежногоДокумента = Неопределено Тогда
			ТипПлатежногоДокумента = Перечисления.ТипыПлатежныхДокументов.ПлатежноеПоручение;
		КонецЕсли;
		
		СтрокаДокумента.ТипПлатежногоДокумента = ТипПлатежногоДокумента;
		
		// Хоз. операция по виду оплаты
		Если СтрокаДокумента.ВидОплаты = "03" Тогда
			СтрокаДокумента.ВидОперации = Перечисления.ХозяйственныеОперации.СнятиеНаличныхДенежныхСредств;
			
		ИначеЕсли СтрокаДокумента.ВидОплаты = "04" Тогда
			СтрокаДокумента.ВидОперации = Перечисления.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзКассыНаРасчетныйСчет;
			
		ИначеЕсли СтрокаДокумента.ВидОплаты = "13" Тогда
			Если Исходящий Тогда
				СтрокаДокумента.ВидОперации = Перечисления.ХозяйственныеОперации.ВозвратОплатыНаПлатежнуюКарту;
			Иначе
				СтрокаДокумента.ВидОперации = Перечисления.ХозяйственныеОперации.ПоступлениеОплатыПоПлатежнойКарте;
			КонецЕсли;
		КонецЕсли;       
		
		// Переводы
		Если СтрокаДокумента.Исходящий Тогда
			
			Если ЗначениеЗаполнено(СтрокаДокумента.ПолучательБИК) Тогда
				СтруктураПоиска = Новый Структура("НомерСчета, БИК", СтрокаДокумента.ПолучательСчет, СтрокаДокумента.ПолучательБИК);
			ИначеЕсли ЗначениеЗаполнено(СтрокаДокумента.ПолучательСВИФТ) Тогда
				СтруктураПоиска = Новый Структура("НомерСчета, СВИФТ", СтрокаДокумента.ПолучательСчет, СтрокаДокумента.ПолучательСВИФТ);
			Иначе
				СтруктураПоиска = Новый Структура("НомерСчета", СтрокаДокумента.ПолучательСчет);
			КонецЕсли;
			
			СобственныеСчетаПолучатели = СобственныеСчета.НайтиСтроки(СтруктураПоиска);
			Если СобственныеСчетаПолучатели.Количество() > 0 Тогда
				СтрокаДокумента.ВидОперации = Перечисления.ХозяйственныеОперации.ПеречислениеДенежныхСредствНаДругойСчет;
				СтрокаДокумента.СчетКонтрагента = СобственныеСчетаПолучатели[0]["Ссылка"];
				Если Не ЗначениеЗаполнено(СтрокаДокумента.ДатаСписано) Тогда
					СтрокаДокумента.Загружать = Ложь;
					Продолжить;
				КонецЕсли;
			КонецЕсли;
		Иначе
			
			Если ЗначениеЗаполнено(СтрокаДокумента.ПлательщикБИК) Тогда
				СтруктураПоиска = Новый Структура("НомерСчета, БИК", СтрокаДокумента.ПлательщикСчет, СтрокаДокумента.ПлательщикБИК);
			ИначеЕсли ЗначениеЗаполнено(СтрокаДокумента.ПлательщикСВИФТ) Тогда
				СтруктураПоиска = Новый Структура("НомерСчета, СВИФТ", СтрокаДокумента.ПлательщикСчет, СтрокаДокумента.ПлательщикСВИФТ);
			Иначе
				СтруктураПоиска = Новый Структура("НомерСчета", СтрокаДокумента.ПлательщикСчет);
			КонецЕсли;
			
			СобственныеСчетаОтправители = СобственныеСчета.НайтиСтроки(СтруктураПоиска);
			Если СобственныеСчетаОтправители.Количество() > 0 Тогда
				СтрокаДокумента.ВидОперации = Перечисления.ХозяйственныеОперации.ПоступлениеДенежныхСредствСДругогоСчета;
				СтрокаДокумента.СчетКонтрагента = СобственныеСчетаОтправители[0]["Ссылка"];
				Если Не ЗначениеЗаполнено(СтрокаДокумента.ДатаПоступило) Тогда
					СтрокаДокумента.Загружать = Ложь;
					Продолжить;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		// Инкассация
		Если Не ЗначениеЗаполнено(СтрокаДокумента.ВидОперации) Тогда
			
			БалансовыйСчет = Лев(СтрокаДокумента.ПлательщикСчет, 5);
			Если БалансовыйСчет    = "20202" // поступление/списание наличных из кассы
				Или БалансовыйСчет = "20208" // поступление/списание наличных из банкомата, устройства Cash-in
				Тогда
				Если СтрокаДокумента.Исходящий Тогда
					СтрокаДокумента.ВидОперации = Перечисления.ХозяйственныеОперации.СнятиеНаличныхДенежныхСредств;
				Иначе
					СтрокаДокумента.ВидОперации = Перечисления.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзКассыНаРасчетныйСчет;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли; 
		
		СтрНазначение = СтрокаДокумента.НазначениеПлатежа;
		Если Найти(СтрНазначение, "Внес.") > 0 Тогда
			СтрокаДокумента.ВидОперации = Перечисления.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзКассыНаРасчетныйСчет;
		КонецЕсли;
			
		Если Найти(СтрНазначение, "2200+7294") > 0 Тогда
			СтрокаДокумента.КассаОтправитель = Справочники.Кассы.НайтиПоНаименованию("Касса № 7 Барнаул Альтерра");
		ИначеЕсли Найти(СтрНазначение, "2200+1023") > 0 Тогда
			СтрокаДокумента.КассаОтправитель = Справочники.Кассы.НайтиПоНаименованию("Касса № 1 Выбор Альтерра");
		ИначеЕсли Найти(СтрНазначение, "2200+3635") > 0 Тогда
			СтрокаДокумента.КассаОтправитель = Справочники.Кассы.НайтиПоНаименованию("Касса № 1 Майма Альтерра");
		ИначеЕсли Найти(СтрНазначение, "2200+8956") > 0 Тогда
			СтрокаДокумента.КассаОтправитель = Справочники.Кассы.НайтиПоНаименованию("Касса № 2 Бийск Альтерра");
		ИначеЕсли Найти(СтрНазначение, "2200+0859") > 0 Тогда
			СтрокаДокумента.КассаОтправитель = Справочники.Кассы.НайтиПоНаименованию("Касса № 3 Альтерра ЦБ");
		ИначеЕсли Найти(СтрНазначение, "2200+2767") > 0 Тогда
			СтрокаДокумента.КассаОтправитель = Справочники.Кассы.НайтиПоНаименованию("Касса № 3 Майма Альтерра");
		ИначеЕсли Найти(СтрНазначение, "2200+2673") > 0 Тогда
			СтрокаДокумента.КассаОтправитель = Справочники.Кассы.НайтиПоНаименованию("Касса № 4 Альтерра ЦБ");
		ИначеЕсли Найти(СтрНазначение, "2200+5306") > 0 Тогда
			СтрокаДокумента.КассаОтправитель = Справочники.Кассы.НайтиПоНаименованию("Касса № 4 Бийск Альтерра");
		ИначеЕсли Найти(СтрНазначение, "2200+7460") > 0 Тогда
			СтрокаДокумента.КассаОтправитель = Справочники.Кассы.НайтиПоНаименованию("Касса № 5 Выбор Альтерра");
		ИначеЕсли Найти(СтрНазначение, "2200+4062") > 0 Тогда
			СтрокаДокумента.КассаОтправитель = Справочники.Кассы.НайтиПоНаименованию("Касса № 6 Барнаул Альтерра");
		ИначеЕсли Найти(СтрНазначение, "2200+9175") > 0 Тогда
			СтрокаДокумента.КассаОтправитель = Справочники.Кассы.НайтиПоНаименованию("Касса №1 Барнаул Альтерра");
		ИначеЕсли Найти(СтрНазначение, "7023580358") > 0 Тогда
			СтрокаДокумента.КассаОтправитель = Справочники.Кассы.НайтиПоНаименованию("Касса № 1 Бийск Альтерра");
		ИначеЕсли Найти(СтрНазначение, "7286240310") > 0 Тогда
			СтрокаДокумента.КассаОтправитель = Справочники.Кассы.НайтиПоНаименованию("Касса № 2 Альтерра ЦБ");
		ИначеЕсли Найти(СтрНазначение, "7581105598") > 0 Тогда
			СтрокаДокумента.КассаОтправитель = Справочники.Кассы.НайтиПоНаименованию("Касса № 2 Майма Альтерра");
		ИначеЕсли Найти(СтрНазначение, "7342295225") > 0 Тогда
			СтрокаДокумента.КассаОтправитель = Справочники.Кассы.НайтиПоНаименованию("Касса № 3 Выбор Альтерра");
		ИначеЕсли Найти(СтрНазначение, "7541021760") > 0 Тогда
			СтрокаДокумента.КассаОтправитель = Справочники.Кассы.НайтиПоНаименованию("Касса № 4 Выбор Альтерра");
		ИначеЕсли Найти(СтрНазначение, "7665920938") > 0 Тогда
			СтрокаДокумента.КассаОтправитель = Справочники.Кассы.НайтиПоНаименованию("Касса № 6 Альтерра ЦБ");
		ИначеЕсли Найти(СтрНазначение, "2200+9217") > 0 Тогда
			СтрокаДокумента.КассаОтправитель = Справочники.Кассы.НайтиПоНаименованию("Касса № 3 Выбор Альтерра");
		ИначеЕсли Найти(СтрНазначение, "2200+2874") > 0 Тогда
			СтрокаДокумента.КассаОтправитель = Справочники.Кассы.НайтиПоНаименованию("Касса № 4 Бийск Альтерра");
		ИначеЕсли Найти(СтрНазначение, "2200+4891") > 0 Тогда
			СтрокаДокумента.КассаОтправитель = Справочники.Кассы.НайтиПоНаименованию("Касса № 4 Майма Альтерра");
		ИначеЕсли Найти(СтрНазначение, "2200+0359") > 0 Тогда
			СтрокаДокумента.КассаОтправитель = Справочники.Кассы.НайтиПоНаименованию("Касса №1 Барнаул Альтерра");
		КонецЕсли;
		
		
		//+ Альтерра
		СтрНазначение = СтрокаДокумента.НазначениеПлатежа;
		Если СтрНайти(СтрНазначение, "Поступление выручки от продажи товаров  в АДМ") > 0
			ИЛИ СтрНайти(СтрНазначение, "Внесение наличных средств через устройства самообслуживания") > 0
			Тогда  
			СтрокаДокумента.КассаОтправитель = ЗаполнитьКассуПоНазначению(СтрокаДокумента.НазначениеПлатежа);
		КонецЕсли;
		
		Если СтрНайти(СтрНазначение, "Единый налоговый платеж") > 0  Тогда  
			СтрокаДокумента.ПоказательТипа = "0";
		КонецЕсли;
		//-
		
		// Контрагент
		Если Исходящий Тогда
			Если СтрокаДокумента.Получатель1 <> "" Тогда
				СтрокаДокумента.ИмяКонтрагента = СтрокаДокумента.Получатель1;
			Иначе
				СтрокаДокумента.ИмяКонтрагента = СтрокаДокумента.Получатель;
			КонецЕсли;
		Иначе
			Если СтрокаДокумента.Плательщик1 <> "" Тогда
				СтрокаДокумента.ИмяКонтрагента = СтрокаДокумента.Плательщик1;
			Иначе
				СтрокаДокумента.ИмяКонтрагента = СтрокаДокумента.Плательщик;
			КонецЕсли;
		КонецЕсли;
		СтруктураНаименования = ДенежныеСредстваСерверЛокализация.НаименованиеОрганизации(СтрокаДокумента.ИмяКонтрагента);
		СтрокаДокумента.СокрИмяКонтрагента = СтруктураНаименования.СокращенноеНаименование;
		
		Если СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Лев(СтрокаДокумента.ИмяКонтрагента, 10)) Тогда
			Если СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Лев(СтрокаДокумента.ИмяКонтрагента, 12)) Тогда
				СтрокаДокумента.ИмяКонтрагента = СокрЛП(Сред(СтрокаДокумента.ИмяКонтрагента, 13));
			Иначе
				СтрокаДокумента.ИмяКонтрагента = СокрЛП(Сред(СтрокаДокумента.ИмяКонтрагента, 11));
			КонецЕсли;
		КонецЕсли;
		
		ИННДляПоиска = ?(Исходящий, СтрокаДокумента.ПолучательИНН, СтрокаДокумента.ПлательщикИНН);
		СтрокаДокумента.ПроверятьИНН = ЗначениеЗаполнено(ИННДляПоиска);
		
		КППДляПоиска = ?(Исходящий, СтрокаДокумента.ПолучательКПП, СтрокаДокумента.ПлательщикКПП);
		СтрокаДокумента.ПроверятьКПП = (ЗначениеЗаполнено(КППДляПоиска) И КППДляПоиска <> "0");
		
		// УИП
		Если ЗначениеЗаполнено(СтрокаДокумента.Код) Тогда
			СтрокаДокумента.ЗаполненУИП = Истина;
		КонецЕсли;
		
		// Назначение платежа
		Если ПустаяСтрока(СтрокаДокумента.НазначениеПлатежа) Тогда
			СтрокаДокумента.НазначениеПлатежа = СтрокаДокумента.НазначениеПлатежа1;
			Для инд = 2 По 6 Цикл
				Если НЕ ЗначениеЗаполнено(СтрокаДокумента["НазначениеПлатежа" + инд]) Тогда
					Прервать;
				КонецЕсли;
				СтрокаДокумента.НазначениеПлатежа =
				СтрокаДокумента.НазначениеПлатежа + Символы.ПС + СтрокаДокумента["НазначениеПлатежа" + инд];
			КонецЦикла;
		КонецЕсли;
		
		СтрокаДокумента.ФорматированноеНазначениеПлатежа =
		ДенежныеСредстваСервер.ФорматироватьНазначениеПлатежа(СтрокаДокумента.НазначениеПлатежа);
		
		// Сумма
		Сумма = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(СтрокаДокумента.Сумма);
		Если Сумма <> Неопределено Тогда
			Если Сумма < 0 Тогда
				Сумма = - Сумма;
			КонецЕсли;
			СтрокаДокумента.СуммаДокумента = Сумма;
			Если Исходящий Тогда
				СтрокаДокумента.СуммаСписано   = Сумма;
			Иначе
				СтрокаДокумента.СуммаПоступило = Сумма;
			КонецЕсли;
		Иначе
			ДобавитьЗамечание(СтрокаДокумента.ОшибкиЗагрузки,
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Неверная сумма документа (%1)!'"), СтрокаДокумента.Сумма));
		КонецЕсли;
		
		//++ Локализация
		// Очередность платежа
		Буфер = СокрЛП(СтрокаДокумента.Очередность);
		Если Буфер <> "" И СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Буфер) Тогда
			СтрокаДокумента.ОчередностьПлатежа = Число(Буфер);
		Иначе
			СтрокаДокумента.ОчередностьПлатежа = 5;
		КонецЕсли;
		
		// Платеж в бюджет
		Если ЗначениеЗаполнено(СтрокаДокумента.СтатусСоставителя) Тогда
			СтрокаДокумента.ПлатежВБюджет = Истина;
			
			Если СтатусыСоставителейТаможенныхПлатежей.Найти(СтрокаДокумента.СтатусСоставителя) <> Неопределено Тогда
				СтрокаДокумента.ВидОперации = Перечисления.ХозяйственныеОперации.ПеречислениеТаможне;
				СтрокаДокумента.ВидПеречисленияВБюджет = Перечисления.ВидыПеречисленийВБюджет.ТаможенныйПлатеж;
			ИначеЕсли СтрокаДокумента.СтатусСоставителя = "08" Тогда
				СтрокаДокумента.ВидПеречисленияВБюджет = Перечисления.ВидыПеречисленийВБюджет.ИнойПлатеж;
			Иначе
				СтрокаДокумента.ВидПеречисленияВБюджет = Перечисления.ВидыПеречисленийВБюджет.НалоговыйПлатеж;
			КонецЕсли;
			
			Если СтрокаДокумента.ВидПеречисленияВБюджет = Перечисления.ВидыПеречисленийВБюджет.НалоговыйПлатеж И Исходящий Тогда
				СтрокаДокумента.ВидОперации = Перечисления.ХозяйственныеОперации.ПеречислениеВБюджет;
			ИначеЕсли СтрокаДокумента.ВидПеречисленияВБюджет = Перечисления.ВидыПеречисленийВБюджет.ТаможенныйПлатеж И Исходящий Тогда
				СтрокаДокумента.ВидОперации = Перечисления.ХозяйственныеОперации.ПеречислениеТаможне;
			ИначеЕсли СтрокаДокумента.ВидПеречисленияВБюджет = Перечисления.ВидыПеречисленийВБюджет.ИнойПлатеж И Исходящий Тогда
				СтрокаДокумента.ВидОперации = Перечисления.ХозяйственныеОперации.ПрочаяВыдачаДенежныхСредств;
			КонецЕсли;
		КонецЕсли;
		
		// Показатель даты бюджетного платежа
		Если НЕ ПустаяСтрока(СтрокаДокумента.ПоказательДаты) Тогда
			СтрокаДокумента.ПоказательДатыДок = ДенежныеСредстваКлиентСервер.ПолучитьДатуИзСтроки(СтрокаДокумента.ПоказательДаты);
			Если НЕ ЗначениеЗаполнено(СтрокаДокумента.ПоказательДатыДок) Тогда
				СтрокаДокумента.ПоказательДатыДок = Неопределено;
			КонецЕсли;
		КонецЕсли;
		//-- Локализация
		
		// Дата проведения банком
		Если Исходящий Тогда
			Если Не ЗначениеЗаполнено(СтрокаДокумента.Списано) Тогда
				
				Если ЗначениеЗаполнено(СтрокаДокумента.ДатаСписано) Тогда
					СтрокаДокумента.Списано = ДенежныеСредстваКлиентСервер.ПолучитьДатуИзСтроки(
					СтрокаДокумента.ДатаСписано);
				Иначе
					СтрокаДокумента.Списано = ДенежныеСредстваКлиентСервер.ПолучитьДатуИзСтроки(
					СтрокаДокумента.Дата);
				КонецЕсли;
				
				Если ЗначениеЗаполнено(СтрокаДокумента.Списано) Тогда
					СтрокаДокумента.ДатаПроведения = СтрокаДокумента.Списано;
				КонецЕсли;
			КонецЕсли;
		Иначе
			Если Не ЗначениеЗаполнено(СтрокаДокумента.Поступило) Тогда
				
				Если ЗначениеЗаполнено(СтрокаДокумента.ДатаПоступило) Тогда
					СтрокаДокумента.Поступило = ДенежныеСредстваКлиентСервер.ПолучитьДатуИзСтроки(
					СтрокаДокумента.ДатаПоступило);
				Иначе
					СтрокаДокумента.Поступило = ДенежныеСредстваКлиентСервер.ПолучитьДатуИзСтроки(
					СтрокаДокумента.Дата);
				КонецЕсли;
				
				Если ЗначениеЗаполнено(СтрокаДокумента.Поступило) Тогда
					СтрокаДокумента.ДатаПроведения = СтрокаДокумента.Поступило;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		//++ Локализация
		// Дата отсылки платежного требования
		Если Не ПустаяСтрока(СтрокаДокумента.ДатаОтсылкиДок) Тогда
			СтрокаДокумента.ДатаОтсылки = ДенежныеСредстваКлиентСервер.ПолучитьДатуИзСтроки(СтрокаДокумента.ДатаОтсылкиДок);
		КонецЕсли;
		//-- Локализация
	КонецЦикла;
	
	ДокументыКЗагрузке.Колонки.Добавить("ТолькоПрочиеОтношения", Новый ОписаниеТипов("Булево"));
	ДокументыКЗагрузке.Колонки.Добавить("ТипСуммыКредитаДепозита", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыСуммГрафикаКредитовИДепозитов"));
	ДокументыКЗагрузке.Колонки.Добавить("ВалютаВзаиморасчетов", Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	
	// Ранее загруженные/введенные вручную документы
	Отбор = Новый Структура;
	Отбор.Вставить("Загружать", Истина);
	СтрокиКЗагрузке = ДокументыКЗагрузке.НайтиСтроки(Отбор);
	ТаблицаДокументов = ДокументыКЗагрузке.Скопировать(
	СтрокиКЗагрузке,
	"НомерСтроки, ДатаДок, Поступило, Списано, Номер, НомерСокр, Исходящий, ПолучательСчет, ПлательщикСчет, ТипПлатежногоДокумента,
	|ПолучательИНН, ПлательщикИНН, ПолучательКПП, ПлательщикКПП, ПроверятьИНН, ПроверятьКПП, ДанныеВыписки, Код, Операция");
	ЗаполнитьСсылкиНаДокументы(ДокументыКЗагрузке, ТаблицаДокументов, БанковскийСчет);
	
	// Основание платежа по УИП
	Отбор = Новый Структура;
	Отбор.Вставить("Загружать", Истина);
	Отбор.Вставить("Исходящий", Ложь);
	Отбор.Вставить("НайденДокументВБазе", Ложь);
	Отбор.Вставить("ЗаполненУИП", Истина);
	СтрокиКЗагрузке = ДокументыКЗагрузке.НайтиСтроки(Отбор);
	Если СтрокиКЗагрузке.Количество() Тогда
		ТаблицаДокументов = ДокументыКЗагрузке.Скопировать(СтрокиКЗагрузке, "НомерСтроки, Код, Исходящий");
		КлиентБанкСервер.Док_ЗаполнитьОснованиеПлатежейПоУИП(ДокументыКЗагрузке, ТаблицаДокументов, БанковскийСчет);
	КонецЕсли;
	
	// Контрагенты, счета контрагентов
	Отбор = Новый Структура;
	Отбор.Вставить("Загружать", Истина);
	СтрокиКЗагрузке = ДокументыКЗагрузке.НайтиСтроки(Отбор);
	ТаблицаДокументов = ДокументыКЗагрузке.Скопировать(
	СтрокиКЗагрузке,
	"НомерСтроки, Исходящий, ИмяКонтрагента, СокрИмяКонтрагента, Контрагент,
	|ПолучательСчет, ПлательщикСчет, ПолучательИНН, ПлательщикИНН, ПолучательКПП, ПлательщикКПП, ПроверятьИНН, ПроверятьКПП, ВидОперации");
	ЗаполнитьКонтрагентов(ДокументыКЗагрузке, ТаблицаДокументов);
	
	//+ Альтерра	
	ЗаполнитьПоНастройкам(ДокументыКЗагрузке);
	//-
	
	// Партнеры
	Отбор = Новый Структура;
	Отбор.Вставить("Загружать", Истина);
	Отбор.Вставить("НайденКонтрагент", Истина);
	СтрокиКЗагрузке = ДокументыКЗагрузке.НайтиСтроки(Отбор);
	ТаблицаДокументов = ДокументыКЗагрузке.Скопировать(
	СтрокиКЗагрузке,
	"НомерСтроки, Контрагент, Партнер");
	КлиентБанкСервер.Док_ЗаполнитьПартнеров(ДокументыКЗагрузке, ТаблицаДокументов, БанковскийСчет);
	
	// Образцы документов для заполнения
	Отбор = Новый Структура;
	Отбор.Вставить("Загружать", Истина);
	Отбор.Вставить("НайденДокументВБазе", Ложь);
	Отбор.Вставить("НайденоОснованиеПлатежа", Ложь);
	Отбор.Вставить("НайденСчетКонтрагента", Истина);
	СтрокиКЗагрузке = ДокументыКЗагрузке.НайтиСтроки(Отбор);
	КлиентБанкСервер.Док_ЗаполнитьОбразцы(СтрокиКЗагрузке, БанковскийСчет);
	
	// Заполнение по косвенным данным
	Отбор = Новый Структура;
	Отбор.Вставить("Загружать", Истина);
	Отбор.Вставить("НайденДокументВБазе", Ложь);
	Отбор.Вставить("НайденоОснованиеПлатежа", Ложь);
	Отбор.Вставить("НайденОбразец", Ложь);
	Отбор.Вставить("НайденКонтрагент", Истина);
	СтрокиКЗагрузке = ДокументыКЗагрузке.НайтиСтроки(Отбор);
	КлиентБанкСервер.Док_ЗаполнитьПоКосвеннымДанным(СтрокиКЗагрузке, БанковскийСчет);
	
	// Поиск ПКО при инкассации
	Отбор = Новый Структура;
	Отбор.Вставить("Загружать", Истина);
	Отбор.Вставить("НайденДокументВБазе", Ложь);
	Отбор.Вставить("НайденоОснованиеПлатежа", Ложь);
	Отбор.Вставить("НайденОбразец", Ложь);
	Отбор.Вставить("ВидОперации", Перечисления.ХозяйственныеОперации.СнятиеНаличныхДенежныхСредств);
	СтрокиКЗагрузке = ДокументыКЗагрузке.НайтиСтроки(Отбор);
	ТаблицаДокументов = ДокументыКЗагрузке.Скопировать(
	СтрокиКЗагрузке,
	"НомерСтроки, СуммаДокумента, ДатаПроведения");
	КлиентБанкСервер.Док_ЗаполнитьКассовыйДокумент(ДокументыКЗагрузке, ТаблицаДокументов, БанковскийСчет, Истина);
	
	// Поиск РКО при инкассации
	Отбор = Новый Структура;
	Отбор.Вставить("Загружать", Истина);
	Отбор.Вставить("НайденДокументВБазе", Ложь);
	Отбор.Вставить("НайденоОснованиеПлатежа", Ложь);
	Отбор.Вставить("НайденОбразец", Ложь);
	Отбор.Вставить("ВидОперации", Перечисления.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзКассыНаРасчетныйСчет);
	СтрокиКЗагрузке = ДокументыКЗагрузке.НайтиСтроки(Отбор);
	ТаблицаДокументов = ДокументыКЗагрузке.Скопировать(
	СтрокиКЗагрузке,
	"НомерСтроки, СуммаДокумента, ДатаПроведения");
	КлиентБанкСервер.Док_ЗаполнитьКассовыйДокумент(ДокументыКЗагрузке, ТаблицаДокументов, БанковскийСчет, Ложь);
	
КонецПроцедуры

Функция ЗаполнитьКассуПоНазначению(Назначение)
	
	НайденнаяКасса = Справочники.Кассы.ПустаяСсылка();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Кассы.Ссылка КАК Ссылка,
	|	Кассы.Кассир.Наименование КАК Кассир
	|ИЗ
	|	Справочник.Кассы КАК Кассы
	|ГДЕ
	|	НЕ Кассы.Кассир.Ссылка ЕСТЬ NULL";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		Фамилия = Лев(Выборка.Кассир, СтрНайти(Выборка.Кассир," ")-1);
		Логин = Выборка.Кассир;
		Если (Не Фамилия = "" И СтрНайти(Назначение, Фамилия) > 0)
			ИЛИ (Фамилия = "" И СтрНайти(Назначение, Логин) > 0) 
			Тогда
			НайденнаяКасса =  Выборка.Ссылка;  
		КонецЕсли;	
	КонецЦикла;   
	Возврат НайденнаяКасса;
КонецФункции	

Процедура ЗаполнитьПоНастройкам(ДокументыКЗагрузке)
	
	Структура = ДопМодуль.ПолучитьНастройкиХранилища("НастройкиРазноскиВыписокБанка");
	Если ТипЗнч(Структура) = Тип("Структура") И Структура.Свойство("Настройки") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокументыКЗагрузке.НазначениеПлатежа КАК НазначениеПлатежа
		|ПОМЕСТИТЬ ВтДокументыКЗагрузке
		|ИЗ
		|	&ДокументыКЗагрузке КАК ДокументыКЗагрузке
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Настройки.ТекстНазначенияПлатежа КАК ТекстНазначенияПлатежа,
		|	Настройки.ХозяйственнаяОперацияПоступление КАК ХозяйственнаяОперацияПоступление,
		|	Настройки.ХозяйственнаяОперацияСписание КАК ХозяйственнаяОперацияСписание,
		|	Настройки.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
		|	Настройки.Контрагент КАК Контрагент
		|ПОМЕСТИТЬ ВтНастройки
		|ИЗ
		|	&Настройки КАК Настройки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВтДокументыКЗагрузке.НазначениеПлатежа КАК НазначениеПлатежа,
		|	ВтНастройки.ТекстНазначенияПлатежа КАК ТекстНазначенияПлатежа,
		|	ВтНастройки.ХозяйственнаяОперацияПоступление КАК ХозяйственнаяОперацияПоступление,
		|	ВтНастройки.ХозяйственнаяОперацияСписание КАК ХозяйственнаяОперацияСписание,
		|	ВтНастройки.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
		|	ВтНастройки.Контрагент КАК Контрагент
		|ИЗ
		|	ВтДокументыКЗагрузке КАК ВтДокументыКЗагрузке
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтНастройки КАК ВтНастройки
		|		ПО (ВтДокументыКЗагрузке.НазначениеПлатежа ПОДОБНО ""%"" + ВтНастройки.ТекстНазначенияПлатежа + ""%"")";
		
		Запрос.УстановитьПараметр("ДокументыКЗагрузке", ДокументыКЗагрузке.Скопировать( , "НазначениеПлатежа")); 
		Запрос.УстановитьПараметр("Настройки", Структура.Настройки);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл 
			НайденныеСтроки = ДокументыКЗагрузке.НайтиСтроки(Новый Структура("НазначениеПлатежа", Выборка.НазначениеПлатежа));
			Для Каждого Стр Из НайденныеСтроки Цикл
				Если Стр.Исходящий И ЗначениеЗаполнено(Выборка.ХозяйственнаяОперацияСписание) Тогда   
					Стр.ВидОперации = Выборка.ХозяйственнаяОперацияСписание; 
				ИначеЕсли НЕ Стр.Исходящий И ЗначениеЗаполнено(Выборка.ХозяйственнаяОперацияПоступление) Тогда
					Стр.ВидОперации = Выборка.ХозяйственнаяОперацияПоступление; 
				КонецЕсли; 
				
				Если ЗначениеЗаполнено(Выборка.СтатьяДвиженияДенежныхСредств) Тогда
					Стр.СтатьяДвиженияДенежныхСредств = Выборка.СтатьяДвиженияДенежныхСредств; 
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Выборка.Контрагент) Тогда
					Стр.Контрагент = Выборка.Контрагент;  
					Стр.НайденКонтрагент = Истина;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры	

Процедура ЗаполнитьСсылкиНаДокументы(ДокументыКЗагрузке, ТаблицаДокументов, БанковскийСчет)
	
	Запрос = Новый Запрос;
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТаблицаДокументов.НомерСтроки,
	|	ТаблицаДокументов.ДатаДок,
	|	ТаблицаДокументов.Поступило,
	|	ТаблицаДокументов.Списано,
	|	ТаблицаДокументов.Номер,
	|	ТаблицаДокументов.НомерСокр,
	|	ТаблицаДокументов.Исходящий,
	|	ТаблицаДокументов.ТипПлатежногоДокумента,
	|	ТаблицаДокументов.ПолучательСчет,
	|	ТаблицаДокументов.ПлательщикСчет,
	|	ТаблицаДокументов.ПолучательИНН,
	|	ТаблицаДокументов.ПлательщикИНН,
	|	ТаблицаДокументов.ПолучательКПП,
	|	ТаблицаДокументов.ПлательщикКПП,
	|	ТаблицаДокументов.ПроверятьИНН,
	|	ТаблицаДокументов.ПроверятьКПП,
	|	ВЫРАЗИТЬ(ТаблицаДокументов.Код КАК Строка(25)) КАК Код,
	|	ВЫРАЗИТЬ(ТаблицаДокументов.ДанныеВыписки КАК Строка(1024)) КАК ДанныеВыписки,
	|	ВЫРАЗИТЬ(ТаблицаДокументов.Операция КАК Строка(128)) КАК Операция 
	|
	|ПОМЕСТИТЬ ТаблицаДокументов
	|
	|ИЗ
	|	&ТаблицаДокументов КАК ТаблицаДокументов
	|";
	
	Запрос.УстановитьПараметр("ТаблицаДокументов", ТаблицаДокументов);
	Запрос.Выполнить();
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ТаблицаДокументов.НомерСтроки КАК НомерСтроки,
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Проведен КАК Проведен,
	|	ДанныеДокумента.ХозяйственнаяОперация КАК ХозяйственнаяОперация
	|ИЗ
	|	ТаблицаДокументов КАК ТаблицаДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СписаниеБезналичныхДенежныхСредств КАК ДанныеДокумента
	|		ПО (ДанныеДокумента.БанковскийСчет = &БанковскийСчет)
	|			И (НАЧАЛОПЕРИОДА(ДанныеДокумента.ДатаВходящегоДокумента, ДЕНЬ) = ТаблицаДокументов.ДатаДок
	|					И НЕ ДанныеДокумента.ПроведеноБанком
	|				ИЛИ НАЧАЛОПЕРИОДА(ДанныеДокумента.ДатаВходящегоДокумента, ДЕНЬ) = ТаблицаДокументов.ДатаДок
	|					И ДанныеДокумента.ДатаПроведенияБанком = ТаблицаДокументов.Списано
	|					И ДанныеДокумента.ПроведеноБанком)
	|			И (ДанныеДокумента.НомерВходящегоДокумента = ТаблицаДокументов.Номер
	|				ИЛИ ДанныеДокумента.НомерВходящегоДокумента = ТаблицаДокументов.НомерСокр)
	|			И (ДанныеДокумента.ТипПлатежногоДокумента = ТаблицаДокументов.ТипПлатежногоДокумента)
	|			И (ДанныеДокумента.БанковскийСчетПолучатель.НомерСчета = ТаблицаДокументов.ПолучательСчет
	|				ИЛИ ДанныеДокумента.БанковскийСчетКонтрагента.НомерСчета = ТаблицаДокументов.ПолучательСчет
	|				ИЛИ ЕСТЬNULL(ДанныеДокумента.БанковскийСчетПолучатель.НомерСчета, """") = """"
	|					И ЕСТЬNULL(ДанныеДокумента.БанковскийСчетКонтрагента.НомерСчета, """") = """"
	|				ИЛИ ТаблицаДокументов.ПолучательСчет = """")
	|			И (НЕ ТаблицаДокументов.ПроверятьИНН
	|				ИЛИ ЕСТЬNULL(ДанныеДокумента.БанковскийСчетПолучатель.Владелец.ИНН, """") = """"
	|					И ЕСТЬNULL(ДанныеДокумента.БанковскийСчетКонтрагента.Владелец.ИНН, """") = """"
	|				ИЛИ ДанныеДокумента.БанковскийСчетПолучатель.Владелец.ИНН = ТаблицаДокументов.ПолучательИНН
	|				ИЛИ ДанныеДокумента.БанковскийСчетКонтрагента.Владелец.ИНН = ТаблицаДокументов.ПолучательИНН
	|				ИЛИ ДанныеДокумента.БанковскийСчетКонтрагента.ИННКорреспондента = ТаблицаДокументов.ПолучательИНН)
	|			И (НЕ ТаблицаДокументов.ПроверятьКПП
	|				ИЛИ ЕСТЬNULL(ДанныеДокумента.БанковскийСчетПолучатель.Владелец.КПП, """") = """"
	|					И ЕСТЬNULL(ДанныеДокумента.БанковскийСчетКонтрагента.Владелец.КПП, """") = """"
	|				ИЛИ ДанныеДокумента.БанковскийСчетПолучатель.Владелец.КПП = ТаблицаДокументов.ПолучательКПП
	|				ИЛИ ДанныеДокумента.БанковскийСчетКонтрагента.Владелец.КПП = ТаблицаДокументов.ПолучательКПП
	|				ИЛИ ДанныеДокумента.БанковскийСчетКонтрагента.КППКорреспондента = ТаблицаДокументов.ПолучательКПП
	|				ИЛИ (ВЫРАЗИТЬ(ДанныеДокумента.ДанныеВыписки КАК СТРОКА(1024))) = ТаблицаДокументов.ДанныеВыписки
	|					И (ВЫРАЗИТЬ(ДанныеДокумента.ДанныеВыписки КАК СТРОКА(1024))) <> """")
	|ГДЕ
	|	ТаблицаДокументов.Исходящий
	|	И НЕ ДанныеДокумента.Ссылка ЕСТЬ NULL
	|	И НЕ ДанныеДокумента.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаДокументов.НомерСтроки,
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Проведен,
	|	ДанныеДокумента.ХозяйственнаяОперация
	|ИЗ
	|	ТаблицаДокументов КАК ТаблицаДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеБезналичныхДенежныхСредств КАК ДанныеДокумента
	|		ПО (ДанныеДокумента.БанковскийСчет = &БанковскийСчет)
	|			И (НЕ ДанныеДокумента.ДанныеВыписки ПОДОБНО &ТекстСекцияДокументОперацияПоЯндексКассе)
	|			И (НАЧАЛОПЕРИОДА(ДанныеДокумента.ДатаВходящегоДокумента, ДЕНЬ) = ТаблицаДокументов.ДатаДок
	|					И НЕ ДанныеДокумента.ПроведеноБанком
	|				ИЛИ НАЧАЛОПЕРИОДА(ДанныеДокумента.ДатаВходящегоДокумента, ДЕНЬ) = ТаблицаДокументов.ДатаДок
	|					И ДанныеДокумента.ДатаПроведенияБанком = ТаблицаДокументов.Поступило
	|					И ДанныеДокумента.ПроведеноБанком)
	|			И (ДанныеДокумента.НомерВходящегоДокумента = ТаблицаДокументов.Номер
	|				ИЛИ ДанныеДокумента.НомерВходящегоДокумента = ТаблицаДокументов.НомерСокр)
	|			И (ДанныеДокумента.ТипПлатежногоДокумента = ТаблицаДокументов.ТипПлатежногоДокумента)
	|			И (ДанныеДокумента.БанковскийСчетОтправитель.НомерСчета = ТаблицаДокументов.ПлательщикСчет
	|				ИЛИ ДанныеДокумента.БанковскийСчетКонтрагента.НомерСчета = ТаблицаДокументов.ПлательщикСчет
	|				ИЛИ ЕСТЬNULL(ДанныеДокумента.БанковскийСчетОтправитель.НомерСчета, """") = """"
	|					И ЕСТЬNULL(ДанныеДокумента.БанковскийСчетКонтрагента.НомерСчета, """") = """"
	|				ИЛИ ТаблицаДокументов.ПлательщикСчет = """")
	|			И (НЕ ТаблицаДокументов.ПроверятьИНН
	|				ИЛИ ЕСТЬNULL(ДанныеДокумента.БанковскийСчетОтправитель.Владелец.ИНН, """") = """"
	|					И ЕСТЬNULL(ДанныеДокумента.БанковскийСчетКонтрагента.Владелец.ИНН, """") = """"
	|				ИЛИ ДанныеДокумента.БанковскийСчетОтправитель.Владелец.ИНН = ТаблицаДокументов.ПлательщикИНН
	|				ИЛИ ДанныеДокумента.БанковскийСчетКонтрагента.Владелец.ИНН = ТаблицаДокументов.ПлательщикИНН
	|				ИЛИ ДанныеДокумента.БанковскийСчетКонтрагента.ИННКорреспондента = ТаблицаДокументов.ПолучательИНН)
	|			И (НЕ ТаблицаДокументов.ПроверятьИНН
	|				ИЛИ ЕСТЬNULL(ДанныеДокумента.Контрагент.ИНН, """") = """"
	|					И ЕСТЬNULL(ДанныеДокумента.ПодотчетноеЛицо.ИНН, """") = """"
	|				ИЛИ ДанныеДокумента.Контрагент.ИНН = ТаблицаДокументов.ПлательщикИНН
	|				ИЛИ ДанныеДокумента.ПодотчетноеЛицо.ИНН = ТаблицаДокументов.ПлательщикИНН)
	|			И (НЕ ТаблицаДокументов.ПроверятьКПП
	|				ИЛИ ЕСТЬNULL(ДанныеДокумента.Контрагент.КПП, """") = """"
	|				ИЛИ ДанныеДокумента.Контрагент.КПП = ТаблицаДокументов.ПлательщикКПП
	|				ИЛИ (ВЫРАЗИТЬ(ДанныеДокумента.ДанныеВыписки КАК СТРОКА(1024))) = ТаблицаДокументов.ДанныеВыписки
	|					И (ВЫРАЗИТЬ(ДанныеДокумента.ДанныеВыписки КАК СТРОКА(1024))) <> """")
	|			И (НЕ ТаблицаДокументов.ПроверятьКПП
	|				ИЛИ ЕСТЬNULL(ДанныеДокумента.БанковскийСчетОтправитель.Владелец.КПП, """") = """"
	|					И ЕСТЬNULL(ДанныеДокумента.БанковскийСчетКонтрагента.Владелец.КПП, """") = """"
	|				ИЛИ ДанныеДокумента.БанковскийСчетОтправитель.Владелец.КПП = ТаблицаДокументов.ПлательщикКПП
	|				ИЛИ ДанныеДокумента.БанковскийСчетКонтрагента.Владелец.КПП = ТаблицаДокументов.ПлательщикКПП
	|				ИЛИ ДанныеДокумента.БанковскийСчетКонтрагента.КППКорреспондента = ТаблицаДокументов.ПолучательКПП
	|				ИЛИ (ВЫРАЗИТЬ(ДанныеДокумента.ДанныеВыписки КАК СТРОКА(1024))) = ТаблицаДокументов.ДанныеВыписки
	|					И (ВЫРАЗИТЬ(ДанныеДокумента.ДанныеВыписки КАК СТРОКА(1024))) <> """")
	|ГДЕ
	|	НЕ ТаблицаДокументов.Исходящий
	|	И НЕ ДанныеДокумента.Ссылка ЕСТЬ NULL
	|	И НЕ ДанныеДокумента.ПометкаУдаления
	|	И НЕ ТаблицаДокументов.Операция ПОДОБНО &ТекстОперацияПоЯндексКассе
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаДокументов.НомерСтроки,
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Проведен,
	|	ДанныеДокумента.ХозяйственнаяОперация
	|ИЗ
	|	ТаблицаДокументов КАК ТаблицаДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеБезналичныхДенежныхСредств КАК ДанныеДокумента
	|		ПО (ДанныеДокумента.БанковскийСчет = &БанковскийСчет)
	|			И (ДанныеДокумента.ИдентификаторПлатежа = ТаблицаДокументов.Код)
	|			И (ДанныеДокумента.ДанныеВыписки ПОДОБНО &ТекстСекцияДокументОперацияПоЯндексКассе)
	|ГДЕ
	|	НЕ ТаблицаДокументов.Исходящий
	|	И НЕ ДанныеДокумента.Ссылка ЕСТЬ NULL
	|	И НЕ ДанныеДокумента.ПометкаУдаления
	|	И ТаблицаДокументов.Код <> """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаДокументов.НомерСтроки,
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Проведен,
	|	ДанныеДокумента.ХозяйственнаяОперация
	|ИЗ
	|	ТаблицаДокументов КАК ТаблицаДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеБезналичныхДенежныхСредств КАК ДанныеДокумента
	|		ПО (ДанныеДокумента.БанковскийСчет = &БанковскийСчет)
	|			И (ДанныеДокумента.ИдентификаторПлатежа = ТаблицаДокументов.Код)
	|ГДЕ
	|	НЕ ТаблицаДокументов.Исходящий
	|	И НЕ ДанныеДокумента.Ссылка ЕСТЬ NULL
	|	И НЕ ДанныеДокумента.ПометкаУдаления
	|	И ТаблицаДокументов.Код <> """"
	|	И ТаблицаДокументов.Операция ПОДОБНО &ТекстОперацияПоЯндексКассе
	|
	|УПОРЯДОЧИТЬ ПО
	|	Проведен УБЫВ";
	
	Запрос.УстановитьПараметр("БанковскийСчет", БанковскийСчет);
	
	//++ Локализация
	Запрос.УстановитьПараметр("ТекстОперацияПоЯндексКассе", "Операция по Яндекс.Кассе%");
	Запрос.УстановитьПараметр("ТекстСекцияДокументОперацияПоЯндексКассе", "СЕКЦИЯДОКУМЕНТ=Операция по Яндекс.Кассе%");
	//-- Локализация
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтрокаДокумента = ДокументыКЗагрузке.Найти(Выборка.НомерСтроки, "НомерСтроки");
		Если СтрокаДокумента <> Неопределено Тогда
			
			// Если документ найден, создавать новый не будем. Если найдено несколько документов,
			// то дубли документа пропускаем, обновляем только первый найденный документ.
			Если ЗначениеЗаполнено(СтрокаДокумента.Документ) Тогда
				Продолжить;
			КонецЕсли;
			СтрокаДокумента.Документ = Выборка.Ссылка;
			СтрокаДокумента.НайденДокументВБазе = Истина;
			СтрокаДокумента.ВидОперации = Выборка.ХозяйственнаяОперация;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли

&ИзменениеИКонтроль("Загрузить")
Процедура Док_Загрузить(ПараметрыЗагрузки, АдресХранилища) Экспорт

	//++ Локализация
	Если ПараметрыЗагрузки.ПрямойОбмен Тогда

		ЗамерПроизводительности = ОценкаПроизводительности.НачатьЗамерДлительнойОперации("Обработка.КлиентБанк.МодульМенеджера.Загрузить");
		ДанныеВыписки = РазобратьДеревоВыписки(ПараметрыЗагрузки.СтрокиВыписки);

	Иначе

		Если ПараметрыЗагрузки.ФайлПодтвержденияЗачисления Тогда

			ЗагрузитьПодтверждениеЗачисления(ПараметрыЗагрузки, АдресХранилища);
			Возврат;

		КонецЕсли;

		//-- Локализация
		Если ПараметрыЗагрузки.ФорматОбмена = Перечисления.ФорматОбменаСБанком.ClientBankExchange1c Тогда

			ЗамерПроизводительности = ОценкаПроизводительности.НачатьЗамерДлительнойОперации("Обработка.КлиентБанк.МодульМенеджера.Загрузить");
			ДанныеВыписки = ДенежныеСредстваКлиентСервер.РазобратьФайлВыписки1CClientBankExchange(
			ПараметрыЗагрузки.СтрокиВыписки);

		Иначе

			ЗамерПроизводительности = ОценкаПроизводительности.НачатьЗамерДлительнойОперации("Обработка.КлиентБанк.МодульМенеджера.Загрузить");
			ДанныеВыписки = Обработки.КлиентБанк.ПрочитатьДанныеВыпискиИзФайла(
			ПараметрыЗагрузки.СтрокиВыписки, ПараметрыЗагрузки.ФорматОбмена, ПараметрыЗагрузки.Кодировка);

		КонецЕсли;
		//++ Локализация
	КонецЕсли;
	//-- Локализация

	Если ДанныеВыписки <> Неопределено
		И (ДенежныеСредстваКлиентСервер.ЕстьСчетВФайлеВыписки(ПараметрыЗагрузки.БанковскийСчет, ДанныеВыписки)
		Или ПараметрыЗагрузки.ПрямойОбмен) Тогда

		БанковскийСчет = ПараметрыЗагрузки.БанковскийСчет; 
		
		#Вставка
		Эквайер = ПараметрыЗагрузки.Эквайер;
		СчетЭквайера = ПараметрыЗагрузки.СчетЭквайера;
		#КонецВставки
		
		РеквизитыСчета = Справочники.БанковскиеСчетаОрганизаций.ПолучитьРеквизитыБанковскогоСчетаОрганизации(БанковскийСчет);
		Валюта = РеквизитыСчета.Валюта;
		НомерСчета = СокрЛП(РеквизитыСчета.НомерСчета);

		РегистрыСведений.ПоследнийОбменСБанками.СоздатьЗапись(
		БанковскийСчет, Новый Структура("ДатаНачалаЗагрузки, ДатаКонцаЗагрузки",
		ПараметрыЗагрузки.ДатаНачалаЗагрузки, ПараметрыЗагрузки.ДатаКонцаЗагрузки));

		ЗаписатьОстаткиНаСчетахПоДаннымВыписки(
		БанковскийСчет, РеквизитыСчета, ДанныеВыписки, ПараметрыЗагрузки.ДатаНачалаЗагрузки, ПараметрыЗагрузки.ДатаКонцаЗагрузки);

		ДокументыВыписки = ДанныеВыписки.ДокументыВыписки;
		ДокументыКЗагрузке = ПараметрыЗагрузки.ДокументыКЗагрузке;

		Если Не ДокументыВыписки.Количество() Тогда
			ОценкаПроизводительности.ЗакончитьЗамерДлительнойОперации(ЗамерПроизводительности, 0);
			Возврат;
		КонецЕсли;

		НомерСтроки = 0;
		Для каждого ДокументВыписки Из ДокументыВыписки Цикл

			ДанныеДокумента = НайтиРазбитыйПлатеж(ДокументыКЗагрузке, ДокументВыписки);

			Если ДанныеДокумента <> Неопределено Тогда

				ДанныеДокумента.ДанныеВыписки = СтрШаблон("%1
				|%2", ДанныеДокумента.ДанныеВыписки, ДокументВыписки.ДанныеВыписки);
				ДанныеДокумента.Сумма = СтрШаблон("%1 + %2", ДанныеДокумента.Сумма, ДокументВыписки.Сумма);
				Продолжить;

			КонецЕсли;

			ДокументКЗагрузке = ДокументыКЗагрузке.Добавить();
			ЗаполнитьЗначенияСвойств(ДокументКЗагрузке, ДокументВыписки);
			ДокументКЗагрузке.БанковскийСчет = БанковскийСчет;
			ДокументКЗагрузке.Валюта = Валюта;
			ДокументКЗагрузке.СоздаватьКонтрагента = Истина;
			ДокументКЗагрузке.НомерСокр = ПрефиксацияОбъектовКлиентСервер.УдалитьЛидирующиеНулиИзНомераОбъекта(ДокументКЗагрузке.Номер);
			ДокументКЗагрузке["НомерСтроки"] = НомерСтроки;
			ДокументКЗагрузке.Комментарий = НСтр("ru = '#Загружен из Клиент-Банка'");

			// Исключение дублирования платежей с переводами между счетами организаций.
			// Выполняется проверка счет плательщика и счет получателя в секции расчетных счетов и направление платежа
			// по реквизитам ДатаСписано и ДатаПоступило.
			РазличныеСчета = ДокументКЗагрузке.ПлательщикСчет <> ДокументКЗагрузке.ПолучательСчет;

			ПлатежОрганизацииПолучателя = 
			ДокументКЗагрузке.ПлательщикСчет = НомерСчета
			И РазличныеСчета
			И ДенежныеСредстваКлиентСервер.ЕстьСчетВФайлеВыписки(ДокументКЗагрузке.ПолучательСчет, ДанныеВыписки)
			И Не ЗначениеЗаполнено(ДокументКЗагрузке.ДатаСписано)
			И ЗначениеЗаполнено(ДокументКЗагрузке.ДатаПоступило);

			ПлатежОрганизацииПлательщика =
			ДокументКЗагрузке.ПолучательСчет = НомерСчета
			И РазличныеСчета
			И ДенежныеСредстваКлиентСервер.ЕстьСчетВФайлеВыписки(ДокументКЗагрузке.ПлательщикСчет, ДанныеВыписки)
			И ЗначениеЗаполнено(ДокументКЗагрузке.ДатаСписано)
			И Не ЗначениеЗаполнено(ДокументКЗагрузке.ДатаПоступило);

			Если ПлатежОрганизацииПолучателя
				Или ПлатежОрганизацииПлательщика Тогда
				ДокументКЗагрузке.Загружать = Ложь;
			Иначе
				ДокументКЗагрузке.Загружать = Истина;
			КонецЕсли;

			НомерСтроки = НомерСтроки + 1;
		КонецЦикла;
		
		#Удаление
		КлиентБанкСервер.ПодготовитьСтрокиВыписки(ДокументыКЗагрузке, БанковскийСчет, РеквизитыСчета, ПараметрыЗагрузки);
		#КонецУдаления
		#Вставка
		ПодготовитьСтрокиВыписки_Расширение(ДокументыКЗагрузке, БанковскийСчет, РеквизитыСчета, Эквайер, СчетЭквайера); 
		#КонецВставки      
		
		ПроверитьДубликатыПлатежейВыписки(ДокументыКЗагрузке);
		КлиентБанкСервер.ОбновитьДокументы(ДокументыКЗагрузке, БанковскийСчет, ПараметрыЗагрузки);
		КлиентБанкСервер.СоздатьДокументы(ДокументыКЗагрузке, БанковскийСчет, ПараметрыЗагрузки);
		СнятьПризнакПроведения(ДокументыКЗагрузке, БанковскийСчет, ДанныеВыписки.Заголовок);

		ДатыРасчета = Новый Массив;
		Для каждого ДокументКЗагрузке Из ДокументыКЗагрузке Цикл
			Если Не ДокументКЗагрузке.Исходящий И ДатыРасчета.Найти(ДокументКЗагрузке.ДатаДок) = Неопределено Тогда
				ДатыРасчета.Добавить(НачалоДня(ДокументКЗагрузке.ДатаДок));
			КонецЕсли;
		КонецЦикла;
		РегистрыСведений.ГрафикПлатежей.РассчитатьГрафикПлатежейПоОжидаемымПоступлениямДенежныхСредств(ДатыРасчета);

		Отбор = Новый Структура("Загружать", Истина);
		СтрокиКЗагрузке = ДокументыКЗагрузке.НайтиСтроки(Отбор);
		ТаблицаДокументов = ДокументыКЗагрузке.Скопировать(СтрокиКЗагрузке);

		ПоместитьВоВременноеХранилище(ТаблицаДокументов, АдресХранилища);

		ОценкаПроизводительности.ЗакончитьЗамерДлительнойОперации(ЗамерПроизводительности, ДокументыВыписки.Количество());
	Иначе
		ОценкаПроизводительности.ЗакончитьЗамерДлительнойОперации(ЗамерПроизводительности, 1);
	КонецЕсли;

КонецПроцедуры
